app/views/home/index.html.erb

<script language="javascript">$(document).ready(function(){
	$('#one').liteAccordion({
                    onTriggerSlide : function() {
                        this.find('figcaption').fadeOut();
                    },
                    onSlideAnimComplete : function() {
                        this.find('figcaption').fadeIn();
                    },
                    containerWidth : 640,
                    containerHeight: 320,
                    autoPlay : false,
                    pauseOnHover : true,
                    theme : 'light',
                    rounded : false,
                    enumerateSlides : false
            }).find('figcaption:first').show();
});</script>
---
SELECT "accordions".* FROM "accordions"