app/controllers/accordions_controller.rb

SELECT "accordions".* FROM "accordions"
---
  def index
    @accordions = Accordion.all

SELECT "accordions".* FROM "accordions" WHERE "accordions"."id" = ? LIMIT 1  [["id", "298486374"]]
---
  def show
    @accordion = Accordion.find(params[:id])

INSERT INTO "accordions" ("alt_text", "caption_text", "created_at", "indirizzo", "link", "titolo", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @accordion = Accordion.new(params[:accordion])
    if @accordion.save

SELECT "accordions".* FROM "accordions" WHERE "accordions"."id" = ? LIMIT 1  [["id", "298486374"]]
---
  def edit
    @accordion = Accordion.find(params[:id])

SELECT "accordions".* FROM "accordions" WHERE "accordions"."id" = ? LIMIT 1  [["id", "298486374"]]
---
  def update
    @accordion = Accordion.find(params[:id])

SELECT "accordions".* FROM "accordions" WHERE "accordions"."id" = ? LIMIT 1  [["id", "298486374"]]
DELETE FROM "accordions" WHERE "accordions"."id" = ?  [["id", 298486374]]
---
  def destroy
    @accordion = Accordion.find(params[:id])
    @accordion.destroy