app/controllers/home_controller.rb

SELECT "accordions".* FROM "accordions"
---
def index
  @accordion = Accordion.all