app/controllers/projects_controller.rb

  def show
    @project = Project.find(params[:id], :include => :attachment)
---
SELECT "attachments".* FROM "attachments" WHERE "attachments"."project_id" IN (298486374)
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "298486374"]]

  def create
    @project = Project.new(params[:project])
    if @project.save
---
INSERT INTO "projects" ("BigPicture", "copertina", "copertina_thumbnail", "created_at", "data_lavori", "descr_breve", "descrizione", "folder", "localita", "titolo", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "298486374"]]